# Parameters
nc: 4  # 海参、海胆、扇贝、海星
scales:
  n: [0.33, 0.25, 1024]

# Backbone (保持原版，确保能吃预训练权重)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4: 骨干 P3 (小目标原石)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6: 骨干 P4 (中目标原石)
  - [-1, 1, Conv, [1024, 3, 2]]# 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]   # 9: 骨干 P5 (大目标原石)

# Head: 单向解耦特征金字塔 (UDP-Neck) - 彻底打破市面常规
head:
  # ================= 【大目标检测流 (P5)】 =================
  - [-1, 1, Conv, [256, 1, 1]]         # 10: 🔪 暴力降维，1024 强压至 256
  - [-1, 1, SimAM, [256]]              # 11: 🛡️ P5 零参数能量护盾 (已修正参数以防报错)
  - [-1, 3, C2f_PStar, [256]]          # 12: 🚀 提纯后直接作为【大目标输出】 (不用等后面的模块)

  # ================= 【中目标检测流 (P4)】 =================
  - [11, 1, nn.Upsample, [None, 2, 'nearest']] # 13: 拿护盾保护后的特征上采样
  - [6, 1, Conv, [256, 1, 1]]          # 14: 🔪 骨干 P4 强压至 256
  - [[-1, -2], 1, Concat, [1]]         # 15: 融合 (256+256=512)
  - [-1, 3, C2f_PStar, [256]]          # 16: 🚀 提纯解耦，直接作为【中目标输出】

  # ================= 【小目标检测流 (P3)】 =================
  - [16, 1, nn.Upsample, [None, 2, 'nearest']] # 17: 拿中目标纯净特征上采样
  - [4, 1, Conv, [128, 1, 1]]          # 18: 🔪 骨干 P3 极度压缩至 128 (省参数极致)
  - [[-1, -2], 1, Concat, [1]]         # 19: 融合 (128+256=384)
  - [-1, 3, C2f_PStar, [256]]          # 20: 🚀 最终提纯，作为【小目标输出】

  # ================= 【最终检测头】 =================
  # 注意顺序：小目标(20), 中目标(16), 大目标(12)
  - [[20, 16, 12], 1, Detect, [nc]]    # 21