nc: 80  
scales: 
  n: [0.33, 0.25, 1024]

# YOLOv8.0n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] 
  - [-1, 1, DPC, [128]]    
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, DPC, [256]]      
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, DPC, [512]]      
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, DPC, [1024]]    
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  

# YOLOv8.0n head
head:
  - [-1, 1, Conv, [256, 1, 1]]          
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  
  
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  
  - [[-2, -1], 1, Concat, [1]]        
  - [-1, 3, DLGA, [256]]          
  - [-1, 1, Conv, [256, 1, 1]]          
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] 
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] 
  - [[-2, -1], 1, Concat, [1]]           
  - [-1, 3, DLGA, [256]]           
  
  # 替换下采样层
  - [-1, 1, DPC, [256]]               
  - [[-1, 15], 1, Concat, [1]]         
  - [-1, 3, DLGA, [256]]            
  
  # 继续下采样
  - [-1, 1, DPC, [256]]               
  - [[-1, 10], 1, Concat, [1]]          
  - [-1, 3, DLGA, [256]]             
  
  - [[19, 22, 25], 1, Detect, [nc]]      